tests/performance/health_results.txt
Running 30s test @ http://127.0.0.1:8000/health
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05ms  760.48us  70.93ms   97.50%
    Req/Sec    11.74k     1.06k   16.94k    92.77%
  Latency Distribution
     50%    0.99ms
     75%    1.19ms
     90%    1.41ms
     99%    2.33ms
  2810855 requests in 30.10s, 436.94MB read
Requests/sec:  93372.41
Transfer/sec:     14.51MB

--- Health Check Statistics ---
Total requests: 2810855
Non-2xx responses: 0
Socket errors: connect 0, read 0, write 0, timeout 0